#include "student.h"

void help()/*帮助界面*/
{
    printf("\t\t         -----------------------------*帮助菜单*-----------------------------\n\n");
    printf("\n\t\t\t  0.欢迎使用系统帮助！\n");
    printf("\n\t\t\t  1.初次进入系统后,请先选择重新录入学生信息功能;\n");
    printf("\n\t\t\t  2.按照菜单提示键入数字代号;\n");
    printf("\n\t\t\t  3.录入学生信息、删除修改后,系统会自动保存,无需担心数据丢失问题;\n");
    printf("\n\t\t\t  4.请谨慎使用清空数据功能,一旦使用,数据无法找回！\n");
    printf("\n\t\t\t  5.请谨慎使用重新录入学生信息功能功能！\n");
    printf("\n\t\t\t  6.若误入某功能，请按0返回上一界面，无需担心。");
    printf("\n\t\t\t  5.谢谢您的使用！\n\n\n");
    printf("\t\t       --------------------------------------------------------------------\n\n");
    system("pause");
}
