#include "student.h"

void menu()
{
    printf("\t\t\t---------------------------------------------------------------------\n\n");
    printf("\t\t\t       *                 学生信息管理系统                   * \n\n");
    printf("\t\t\t                          *系统功能菜单*                     \n");
    printf("\t\t\t     -------------------------------------------------------------  \n\n");
    printf("\t\t\t                  *初次进入请先按9查看帮助与系统说明*               \n\n\n");
    printf("\t\t\t           * 1.重新录入学生信息     * 2.按学号排序学生信息  \n\n");
    printf("\t\t\t           * 3.查询学生信息　　     * 4.删除单个学生全部信息 \n\n");
    printf("\t\t\t           * 5.修改学生信息　　     * 6.浏览全部已录入学生信息\n\n");
    printf("\t\t\t           * 7.增补学生信息　　     * 8.清空所有数据  \n\n");
    printf("\t\t\t           * 9.帮助与系统说明 　    * 0.退出系统\n\n\n");
    printf("\t\t\t---------------------------------------------------------------------\n\n");
}
